# Homebrew Script for OSX

# Terminal Stuff
# brew "powerlevel10k" # install using oh-my-zsh instead
cask "font-meslo-for-powerlevel10k"

# Dev Tools
cask "visual-studio-code"

# Entertainment
cask "battle-net"
cask "curseforge"
cask "discord"
cask "iina"
cask "plex"
cask "spotify"
cask "parsec"

# Mac Tools
cask "istat-menus"
cask "caldigit-docking-utility"
cask "wifiman"
cask "appcleaner"
cask "daisydisk"
cask "synology-drive"
cask "parallels"
cask "monitorcontrol"

# Productivity apps
cask "1password"
cask "alfred"
cask "microsoft-edge"

