# Homebrew Script for OSX

# Terminal Stuff
# brew "powerlevel10k" # install using oh-my-zsh instead
cask "font-meslo-for-powerlevel10k"

# Dev Tools
cask "visual-studio-code"
mas "TestFlight", id: 899247664
mas "Xcode", id: 497799835

# Entertainment
cask "battle-net"
cask "curseforge"
cask "discord"
cask "iina"
cask "plex"
cask "spotify"

# Mac Tools
cask "istat-menus"
cask "caldigit-docking-utility"
cask "wifiman"
cask "appcleaner"
cask "daisydisk"
cask "synology-drive"
cask "parallels"
mas "Hidden Bar", id: 1452453066
mas "Magnet", id: 441258766

# Productivity apps
cask "1password"
cask "alfred"
cask "microsoft-edge"
mas "Amphetamine", id: 937984704

# Safari Extensions
mas "Wipr", id: 1320666476
mas "Momentum", id: 1564329434
mas "SponsorBlock", id: 1573461917
mas "Save to Raindrop.io", id: 1549370672
mas "1Password for Safari", id: 1569813296

